note/2019/debug-in-emacs/index.org
#+SETUPFILE: ../../setup.org
#+TITLE: Debug in Emacs
#+DATE: <2019-10-05 Sat 14:31>
#+TAGS: Emacs

This is a note  on debugging in Emacs.

* Break

*debug*
- ~debug-on-entry~ :: enter the debugger when a function is called
- ~cancel-debug-on-entry~ :: As the name suggests
- ~toggle-debug-on-error~ :: whether to enter the debugger if an error occurs

*edebug*
- ~edebug-defun~ / ~C-u eval-defun~ :: instrument function to enter stepper when the function runs. To cancel the instrument, simply use ~eval-defun~ to reevaluate the function normally.

* Stepper

[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html#Edebug][Complete list of operations in Modes, Jumping, Misc, Breaks section]]

Some common ones:
- =n= :: step
- =q= :: quit
- =r= :: re-display last value in echo area
- =b= :: set break point, use ~C-u~ to set a one-time break point
- =x= :: set break condition
- =c= :: continue
