note/2019/debug-in-emacs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-04 Tue 00:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Debug in Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Debug in Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf9d4b28">1. Break</a></li>
<li><a href="#orgee4eea3">2. Stepper</a></li>
</ul>
</div>
</div>
<p>
This is a note  on debugging in Emacs.
</p>

<div id="outline-container-orgf9d4b28" class="outline-2">
<h2 id="orgf9d4b28"><span class="section-number-2">1</span> Break</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>debug</b>
</p>
<dl class="org-dl">
<dt><code>debug-on-entry</code></dt><dd>enter the debugger when a function is called</dd>
<dt><code>cancel-debug-on-entry</code></dt><dd>As the name suggests</dd>
<dt><code>toggle-debug-on-error</code></dt><dd>whether to enter the debugger if an error occurs</dd>
</dl>

<p>
<b>edebug</b>
</p>
<dl class="org-dl">
<dt><code>edebug-defun</code> / <code>C-u eval-defun</code></dt><dd>instrument function to enter stepper when the function runs. To cancel the instrument, simply use <code>eval-defun</code> to reevaluate the function normally.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgee4eea3" class="outline-2">
<h2 id="orgee4eea3"><span class="section-number-2">2</span> Stepper</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html#Edebug">Complete list of operations in Modes, Jumping, Misc, Breaks section</a>
</p>

<p>
Some common ones:
</p>
<dl class="org-dl">
<dt><code>n</code></dt><dd>step</dd>
<dt><code>q</code></dt><dd>quit</dd>
<dt><code>r</code></dt><dd>re-display last value in echo area</dd>
<dt><code>b</code></dt><dd>set break point, use <code>C-u</code> to set a one-time break point</dd>
<dt><code>x</code></dt><dd>set break condition</dd>
<dt><code>c</code></dt><dd>continue</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-10-05 Sat 14:31</p>
<p class="author">Author: Yuan Fu</p>
<p class="date">Created: 2020-02-04 Tue 00:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
